Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.ReinforcementVisibility
Defines which bars in the group appear in drawings.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.StraightEndSymbolType
Defines how the straight ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.HookedEndSymbolType
Defines how the hooked ends of reinforcing bars should look like.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.#ctor
Creates a new default reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes.#ctor(System.String)
Creates a new reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.